/*▄────────────────────────────▄
  █                            █
  █  Controller                █
  █  • Коллекция контроллеров  █
  █                            █
  ▀────────────────────────────▀*/
(() => {
/*┌─────────────────────────────┐
  │ Список локальных переменных │
  └─────────────────────────────┘*/
    let _collections = {}; // Список коллекций
    
/*┌────────────────────────────────────────┐
  │ Очищает все коллекции (сборщик мусора) │
  └────────────────────────────────────────┘*/
    $.gc.controller = () => {
        _collections = {}; // Список коллекций
    };
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новую коллекцию в список коллекций │
  └──────────────────────────────────────────────┘*/
    $.Controller = new Proxy(f=>0, {get: (target, collection) => (item) => {
        _collections[collection] = item;
    }});
    
/*┌──────────────────────────────────────────┐
  │ Возвращает коллекцию из списка коллекций │
  └──────────────────────────────────────────┘*/
    $.controller = new Proxy(f=>0, {get: (target, collection) => {
        return _collections[collection];
    }});
})();
