/*▄───────────────────────▄
  █                       █
  █  Model                █
  █  • Коллекция моделей  █
  █                       █
  ▀───────────────────────▀*/
(() => {
/*┌─────────────────────────────┐
  │ Список локальных переменных │
  └─────────────────────────────┘*/
    let _collections = {}; // Список коллекций
    
/*┌────────────────────────────────────────┐
  │ Очищает все коллекции (сборщик мусора) │
  └────────────────────────────────────────┘*/
    $.gc.model = () => {
        _collections = {}; // Список коллекций
    };
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новую коллекцию в список коллекций │
  └──────────────────────────────────────────────┘*/
    $.Model = new Proxy(f=>0, {get: (target, collection) => (item) => {
        _collections[collection] = new item;
    }});
    
/*┌──────────────────────────────────────────┐
  │ Возвращает коллекцию из списка коллекций │
  └──────────────────────────────────────────┘*/
    $.model = new Proxy(f=>0, {get: (target, collection) => {
        return _collections[collection];
    }});
})();
