/*▄───────────────────────────▄
  █                           █
  █  View                     █
  █  • Коллекция интерфейсов  █
  █                           █
  ▀───────────────────────────▀*/
(() => {
/*┌─────────────────────────────┐
  │ Список локальных переменных │
  └─────────────────────────────┘*/
    let _collections = {}; // Список коллекций
    
/*┌────────────────────────────────────────┐
  │ Очищает все коллекции (сборщик мусора) │
  └────────────────────────────────────────┘*/
    $.gc.view = () => {
        _collections = {}; // Список коллекций
    };
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новую коллекцию в список коллекций │
  └──────────────────────────────────────────────┘*/
    $.View = new Proxy(f=>0, {get: (target, collection) => (item) => {
        _collections[collection] = new item;
    }});
    
/*┌──────────────────────────────────────────┐
  │ Возвращает коллекцию из списка коллекций │
  └──────────────────────────────────────────┘*/
    $.view = new Proxy(f=>0, {get: (target, collection) => {
        return _collections[collection];
    }});
})();
